//-----------------------------------------------------------------------------
// カメラクラス.
//-----------------------------------------------------------------------------
#include "Camera.h"

//-----------------------------------------------------------------------------
// コンストラクタ.
//-----------------------------------------------------------------------------
Camera::Camera()
{
	//カメラの描画範囲を設定する
	SetCameraNearFar(10.0f, 2800.0f);

	pos = VGet(0, 0, -120);
}

//-----------------------------------------------------------------------------
// デストラクタ.
//-----------------------------------------------------------------------------
Camera::~Camera()
{
	// 処理なし.
}

void Camera::TitleUpdate()
{
	pos = VGet(90.0f, 20.0f, -1000.0f);

	SetCameraPositionAndTarget_UpVecY(pos, VGet(0, 400, 0));
}

//-----------------------------------------------------------------------------
// 更新.
//-----------------------------------------------------------------------------
void Camera::Update()
{
	// z軸上で、プレイヤーから一定距離離れた状態でプレイヤーを常に見続けるよう位置調整
	
	// lerpを使用して実装.
	// lerp(VECTOR a, VECTOR b, float t)は
	// answer = a + ((b-a) * t)
	//VECTOR aimPos = VGet(player.GetPos().x, player.GetPos().y + 250.0f, player.GetPos().z - 250.0f);
	//VECTOR posToAim = VSub(aimPos, pos);
	//VECTOR scaledPosToAim = VScale(posToAim, 0.1f);
	//pos = VAdd(pos, scaledPosToAim);

	//if ()
	//	pos = VGet(0.0f, 300.0f, -10.0f);
	//else
		pos = VGet(0.0f, 270.0f, -300.0f);

	// カメラに位置を反映.
	SetCameraPositionAndTarget_UpVecY(pos, VGet(0, 0, 0));
}