#pragma once
#include "DxLib.h"

class LevelSelect
{
public:
	LevelSelect();
	~LevelSelect();

	//---éÂóvä÷êî-------------------------------------------------------------------
	void Init();
	void Update();
	//-----------------------------------------------------------------------------

	//---Setä÷êî---------------------------------------------------------------------
	int GetLevelNum() { return m_levelNum; }
	//-----------------------------------------------------------------------------

private:
	int m_levelNum;
};